'''5. Написати скрипт, який залишить в словнику тільки пари із унікальними значеннями (дублікати значень - видалити). Словник для
   роботи захардкодити свій.
                Приклад словника (не використовувати):
                {'a': 1, 'b': 3, 'c': 1, 'd': 5}
                Очікуваний результат:
                {'a': 1, 'b': 3, 'd': 5}'''

dict_in1 = {10:1, 20:2, 30:3, 40:4, 50:2, 60:3, 70:8}
dict_in2 = {}
for key, value in dict_in1.items():
        if value not in dict_in2.values():
                dict_in2[key] = value
#print(dict_in1)
print(dict_in2)
